{
  "en": {
    "meta.title": "Mr Solution - Revolutionary Tech Solutions & AI-Powered Insights | 2025",
    "services.learnMore": "Learn More",
    "form.label": "Your Email",
    "form.label.name": "Your Name",
    "form.name": "Your Name",
    "form.label.email": "Your Email",
    "form.email": "Your Email",
    "form.label.message": "Your Message",
    "form.message": "Your Message",
    "form.submit": "Send Message",
    "form.success": "Message sent successfully!",
    "form.required": "Please fill out all fields.",
    "form.invalidEmail": "Please enter a valid email address.",
    "form.label.password": "Password",
    "form.password": "Password",
    "newsletter.submit": "Subscribe",
    "newsletter.success": "Subscribed successfully!",
    "newsletter.invalidEmail": "Please enter a valid email address.",
    "chat.title": "Live Support",
    "chat.welcome": "Welcome! How can we assist you today?",
    "chat.input": "Type your message...",
    "chat.submit": "Send",
    "chat.response": "Thank you for your message! Our team will get back to you soon.",
    "modal.cta": "Get Started",
    "error.loading": "Failed to load resources. Please try again later.",
    "auth.login.title": "Login",
    "auth.remember": "Remember Me",
    "auth.forgot_password": "Forgot Your Password?",
    "nav.logo": "Mr Solution",
    "nav.home": "Home",
    "nav.about": "About",
    "nav.services": "Services",
    "nav.testimonials": "Testimonials",
    "nav.faq": "FAQ",
    "nav.contact": "Contact",
    "nav.premium": "Get Premium",
    "nav.login": "Login",
    "nav.register": "Register",
    "hero.title": "Revolutionary Tech Solutions",
    "hero.subtitle": "Empowering businesses with AI-driven innovation and cutting-edge technology that transforms possibilities into reality",
    "hero.explore": "Explore Solutions",
    "hero.start": "Start Your Journey",
    "stats.clients": "Satisfied Clients",
    "stats.projects": "Projects Completed",
    "stats.success": "Success Rate %",
    "stats.support": "24/7 Support",
    "services.title": "Our Premium Services",
    "services.ai.title": "AI-Powered Analytics",
    "services.ai.description": "Transform raw data into actionable insights with our advanced machine learning algorithms and predictive analytics platform.",
    "services.ai.detailedDescription": "Our AI-Powered Analytics platform leverages advanced machine learning and predictive modeling to transform your raw data into actionable insights. Gain a competitive edge with real-time analytics, customizable dashboards, and deep learning algorithms tailored to your business needs.",
    "services.cloud.title": "Cloud Infrastructure",
    "services.cloud.description": "Experience unparalleled scalability and reliability with our cloud infrastructure solutions.",
    "services.cloud.detailedDescription": "Experience unparalleled scalability and reliability with our cloud infrastructure solutions. We offer secure, high-performance cloud environments with 99.9% uptime, seamless integration, and automated scaling to support your business growth.",
    "services.cybersecurity.title": "Cybersecurity Suite",
    "services.cybersecurity.description": "Protect your digital assets with our comprehensive cybersecurity suite.",
    "services.cybersecurity.detailedDescription": "Protect your digital assets with our comprehensive cybersecurity suite. Featuring advanced threat detection, real-time monitoring, and proactive defense mechanisms, our solutions ensure your data remains secure against evolving threats.",
    "services.custom.title": "Custom Development",
    "services.custom.description": "Our custom development services deliver bespoke software solutions tailored to your unique requirements.",
    "services.custom.detailedDescription": "Our custom development services deliver bespoke software solutions tailored to your unique requirements. Using the latest frameworks and technologies, we build scalable, secure, and user-friendly applications that drive business success.",
    "services.bi.title": "Business Intelligence",
    "services.bi.description": "Unlock the power of your data with our business intelligence tools.",
    "services.bi.detailedDescription": "Unlock the power of your data with our business intelligence tools. Our real-time dashboards, advanced reporting, and data visualization solutions provide deep insights into performance metrics, helping you make informed strategic decisions.",
    "services.digital.title": "Digital Transformation",
    "services.digital.description": "Accelerate your business with our digital transformation services.",
    "services.digital.detailedDescription": "Accelerate your business with our digital transformation services. We modernize your operations, integrate cutting-edge technologies, and streamline processes to enhance efficiency and maintain a competitive advantage in the digital era.",
    "testimonials.title": "What Industry Leaders Say",
    "testimonials.t1.text": "Mr Solution transformed our entire tech infrastructure. Their AI solutions increased our efficiency by 40% and revolutionized how we approach data analytics.",
    "testimonials.t1.author": "Sarah Johnson",
    "testimonials.t1.role": "CEO, TechNova Inc.",
    "testimonials.t2.text": "The premium support and custom development services exceeded all expectations. Their team delivered solutions that perfectly aligned with our vision.",
    "testimonials.t2.author": "Michael Chen",
    "testimonials.t2.role": "CTO, InnovateX",
    "testimonials.t3.text": "Outstanding cybersecurity implementation. We've had zero security incidents since partnering with Mr Solution. Their proactive approach is unmatched.",
    "testimonials.t3.author": "Emily Rodriguez",
    "testimonials.t3.role": "CISO, SecureCore",
    "faq.title": "Frequently Asked Questions",
    "faq.q1": "What services does Mr Solution offer?",
    "faq.a1": "Mr Solution provides AI-powered analytics, cloud infrastructure, cybersecurity, custom development, business intelligence, and digital transformation services tailored to your business needs.",
    "faq.q2": "How can I get started with a free trial?",
    "faq.a2": "Contact us via the form in the footer or click 'Start Free Trial' in the CTA section, and our team will guide you through the process.",
    "faq.q3": "Is my data secure with your solutions?",
    "faq.a3": "Absolutely. Our cybersecurity suite uses advanced threat detection and encryption to ensure your data is protected at all times.",
    "faq.q4": "Do you offer support for custom projects?",
    "faq.a4": "Yes, our custom development team specializes in building bespoke solutions tailored to your unique requirements.",
    "cta.title": "Ready to Transform Your Business?",
    "cta.description": "Join thousands of companies already leveraging our premium solutions to stay ahead in the digital revolution. Get started with our exclusive premium plan today.",
    "cta.button": "Start Free Trial",
    "cta.view": "View Pricing",
    "footer.about.title": "Mr Solution",
    "footer.about.description": "Leading the future of technology with innovative solutions that empower businesses to achieve unprecedented growth and efficiency.",
    "footer.services.title": "Services",
    "footer.links.title": "Quick Links",
    "footer.contact.title": "Contact",
    "footer.newsletter.title": "Newsletter",
    "footer.newsletter.description": "Stay updated with the latest tech insights and offers!",
    "footer.copyright": "© 2025 Mr Solution. All rights reserved."
  },
  "es": {
    "meta.title": "Mr Solution - Soluciones Tecnológicas Revolucionarias y Perspectivas Impulsadas por IA | 2025",
    "services.learnMore": "Aprende Más",
    "form.label": "Tu Correo Electrónico",
    "form.label.name": "Tu Nombre",
    "form.name": "Tu Nombre",
    "form.label.email": "Tu Correo Electrónico",
    "form.email": "Tu Correo Electrónico",
    "form.label.message": "Tu Mensaje",
    "form.message": "Tu Mensaje",
    "form.submit": "Enviar Mensaje",
    "form.success": "¡Mensaje enviado con éxito!",
    "form.required": "Por favor completa todos los campos.",
    "form.invalidEmail": "Por favor ingresa un correo electrónico válido.",
    "form.label.password": "Contraseña",
    "form.password": "Contraseña",
    "newsletter.submit": "Suscribirse",
    "newsletter.success": "¡Suscripción exitosa!",
    "newsletter.invalidEmail": "Por favor ingresa un correo electrónico válido.",
    "chat.title": "Soporte en Vivo",
    "chat.welcome": "¡Bienvenido! ¿Cómo podemos ayudarte hoy?",
    "chat.input": "Escribe tu mensaje...",
    "chat.submit": "Enviar",
    "chat.response": "¡Gracias por tu mensaje! Nuestro equipo te responderá pronto.",
    "modal.cta": "Comenzar",
    "error.loading": "Error al cargar recursos. Por favor intenta de nuevo más tarde.",
    "auth.login.title": "Iniciar Sesión",
    "auth.remember": "Recordarme",
    "auth.forgot_password": "¿Olvidaste tu contraseña?",
    "nav.logo": "Mr Solution",
    "nav.home": "Inicio",
    "nav.about": "Acerca de",
    "nav.services": "Servicios",
    "nav.testimonials": "Testimonios",
    "nav.faq": "Preguntas Frecuentes",
    "nav.contact": "Contacto",
    "nav.premium": "Obtener Premium",
    "nav.login": "Iniciar Sesión",
    "nav.register": "Registrarse",
    "hero.title": "Soluciones Tecnológicas Revolucionarias",
    "hero.subtitle": "Empoderando a las empresas con innovación impulsada por IA y tecnología de vanguardia que transforma posibilidades en realidad",
    "hero.explore": "Explorar Soluciones",
    "hero.start": "Comienza Tu Viaje",
    "stats.clients": "Clientes Satisfechos",
    "stats.projects": "Proyectos Completados",
    "stats.success": "Tasa de Éxito %",
    "stats.support": "Soporte 24/7",
    "services.title": "Nuestros Servicios Premium",
    "services.ai.title": "Análisis Impulsado por IA",
    "services.ai.description": "Transforma datos brutos en información accionable con nuestros algoritmos avanzados de aprendizaje automático y plataforma de análisis predictivo.",
    "services.ai.detailedDescription": "Nuestra plataforma de Análisis Impulsado por IA utiliza aprendizaje automático avanzado y modelado predictivo para transformar tus datos brutos en información accionable. Obtén una ventaja competitiva con análisis en tiempo real, paneles personalizables y algoritmos de aprendizaje profundo adaptados a tus necesidades comerciales.",
    "services.cloud.title": "Infraestructura en la Nube",
    "services.cloud.description": "Experimenta escalabilidad y confiabilidad sin igual con nuestras soluciones de infraestructura en la nube.",
    "services.cloud.detailedDescription": "Experimenta escalabilidad y confiabilidad sin igual con nuestras soluciones de infraestructura en la nube. Ofrecemos entornos de nube seguros y de alto rendimiento con un 99.9% de tiempo de actividad, integración sin problemas y escalado automatizado para apoyar el crecimiento de tu negocio.",
    "services.cybersecurity.title": "Suite de Ciberseguridad",
    "services.cybersecurity.description": "Protege tus activos digitales con nuestra suite integral de ciberseguridad.",
    "services.cybersecurity.detailedDescription": "Protege tus activos digitales con nuestra suite integral de ciberseguridad. Con detección avanzada de amenazas, monitoreo en tiempo real y mecanismos de defensa proactivos, nuestras soluciones aseguran que tus datos permanezcan seguros frente a amenazas en evolución.",
    "services.custom.title": "Desarrollo Personalizado",
    "services.custom.description": "Nuestros servicios de desarrollo personalizado ofrecen soluciones de software a medida adaptadas a tus requisitos únicos.",
    "services.custom.detailedDescription": "Nuestros servicios de desarrollo personalizado ofrecen soluciones de software a medida adaptadas a tus requisitos únicos. Utilizando los últimos frameworks y tecnologías, construimos aplicaciones escalables, seguras y fáciles de usar que impulsan el éxito empresarial.",
    "services.bi.title": "Inteligencia de Negocios",
    "services.bi.description": "Desbloquea el poder de tus datos con herramientas de inteligencia de negocios.",
    "services.bi.detailedDescription": "Desbloquea el poder de tus datos con nuestras herramientas de inteligencia de negocios. Nuestros paneles en tiempo real, informes avanzados y soluciones de visualización de datos proporcionan información profunda sobre métricas de rendimiento, ayudándote a tomar decisiones estratégicas informadas.",
    "services.digital.title": "Transformación Digital",
    "services.digital.description": "Acelera tu negocio con nuestros servicios de transformación digital.",
    "services.digital.detailedDescription": "Acelera tu negocio con nuestros servicios de transformación digital. Modernizamos tus operaciones, integramos tecnologías de vanguardia y optimizamos procesos para mejorar la eficiencia y mantener una ventaja competitiva en la era digital.",
    "testimonials.title": "Lo que Dicen los Líderes de la Industria",
    "testimonials.t1.text": "Mr Solution transformó toda nuestra infraestructura tecnológica. Sus soluciones de IA aumentaron nuestra eficiencia en un 40% y revolucionaron cómo abordamos los datos.",
    "testimonials.t1.author": "Sarah Johnson",
    "testimonials.t1.role": "Directora Ejecutiva, TechNova Inc.",
    "testimonials.t2.text": "El soporte premium y los servicios de desarrollo personalizado superaron todas las expectativas. Su equipo entregó soluciones perfectamente alineadas con nuestra visión.",
    "testimonials.t2.author": "Michael Chen",
    "testimonials.t2.role": "Director de Tecnología",
    "testimonials.t3.text": "Implementación sobresaliente de ciberseguridad. No hemos tenido incidentes de seguridad desde que nos asociamos con Mr Solution. Su enfoque proactivo es inigualable.",
    "testimonials.t3.author": "Emily Rodriguez",
    "testimonials.t3.role": "Directora de Seguridad de la Información, SecureCore",
    "faq.title": "Preguntas Frecuentes",
    "faq.q1": "¿Qué servicios ofrece Mr Solution?",
    "faq.a1": "Mr Solution ofrece análisis impulsados por IA, infraestructura en la nube, ciberseguridad, desarrollo personalizado, inteligencia de negocios y servicios de transformación digital adaptados a tus necesidades.",
    "faq.q2": "¿Cómo puedo empezar con una prueba gratuita?",
    "faq.a2": "Contáctanos a través del formulario en el footer o haz clic en 'Iniciar Prueba Gratuita' en la sección CTA, y nuestro equipo te guiará en el proceso.",
    "faq.q3": "¿Están seguros mis datos con sus soluciones?",
    "faq.a3": "Absolutamente. Nuestra suite de ciberseguridad utiliza detección avanzada de amenazas y encriptación para garantizar que tus datos estén protegidos en todo momento.",
    "faq.q4": "¿Ofrecen soporte para proyectos personalizados?",
    "faq.a4": "Sí, nuestro equipo de desarrollo personalizado se especializa en construir soluciones a medida adaptadas a tus requisitos únicos.",
    "cta.title": "¿Listo para Transformar tu Negocio?",
    "cta.description": "Únete a miles de empresas que ya están aprovechando nuestras soluciones premium para mantenerse a la vanguardia en la revolución digital. Comienza con nuestro plan premium exclusivo hoy.",
    "cta.button": "Iniciar Prueba Gratuita",
    "cta.view": "Ver Precios",
    "footer.about.title": "Mr Solution",
    "footer.about.description": "Liderando el futuro de la tecnología con soluciones innovadoras que empoderan a las empresas para lograr un crecimiento y eficiencia sin precedentes.",
    "footer.services.title": "Servicios",
    "footer.links.title": "Enlaces Rápidos",
    "footer.contact.title": "Contacto",
    "footer.newsletter.title": "Boletín",
    "footer.newsletter.description": "¡Mantente actualizado con las últimas noticias y ofertas tecnológicas!",
    "footer.copyright": "© 2025 Mr Solution. Todos los derechos reservados."
  },
  "fr": {
    "meta.title": "Mr Solution - Solutions Technologiques Révolutionnaires et Informations Basées sur l'IA | 2025",
    "services.learnMore": "En Savoir Plus",
    "form.label": "Votre Email",
    "form.label.name": "Votre Nom",
    "form.name": "Votre Nom",
    "form.label.email": "Votre Email",
    "form.email": "Votre Email",
    "form.label.message": "Votre Message",
    "form.message": "Votre Message",
    "form.submit": "Envoyer le Message",
    "form.success": "Message envoyé avec succès !",
    "form.required": "Veuillez remplir tous les champs.",
    "form.invalid.email": "Veuillez entrer une adresse email valide.",
    "form.label.password": "Mot de passe",
    "form.password": "Mot de passe",
    "newsletter.submit": "S'abonner",
    "newsletter.success": "Inscription réussie !",
    "newsletter.invalidEmail": "Veuillez entrer une adresse email valide.",
    "chat.title": "Support en Direct",
    "chat.welcome": "Bienvenue ! Comment pouvons-nous vous aider aujourd'hui ?",
    "chat.input": "Tapez votre message...",
    "chat.submit": "Envoyer",
    "chat.response": "Merci pour votre message ! Notre équipe vous répondra bientôt.",
    "modal.cta": "Commencer",
    "error.loading": "Échec du chargement des ressources. Veuillez réessayer plus tard.",
    "auth.login.title": "Connexion",
    "auth.remember": "Se souvenir de moi",
    "auth.forgot_password": "Mot de passe oublié ?",
    "nav.logo": "Mr Solution",
    "nav.home": "Accueil",
    "nav.about": "À propos",
    "nav.services": "Services",
    "nav.testimonials": "Témoignages",
    "nav.faq": "FAQ",
    "nav.contact": "Contact",
    "nav.premium": "Obtenir Premium",
    "nav.login": "Connexion",
    "nav.register": "Inscription",
    "hero.title": "Solutions Technologiques Révolutionnaires",
    "hero.subtitle": "Donner aux entreprises les moyens de réussir grâce à l'innovation basée sur l'IA et à une technologie de pointe qui transforme les possibilités en réalité",
    "hero.explore": "Explorer les Solutions",
    "hero.start": "Commencez Votre Voyage",
    "stats.clients": "Clients Satisfaits",
    "stats.projects": "Projets Terminés",
    "stats.success": "Taux de Réussite %",
    "stats.support": "Support 24/7",
    "services.title": "Nos Services Premium",
    "services.ai.title": "Analyse Basée sur l'IA",
    "services.ai.description": "Transformez les données brutes en informations exploitables grâce à nos algorithmes avancés d'apprentissage automatique et à notre plateforme d'analyse prédictive.",
    "services.ai.detailedDescription": "Notre plateforme d'Analyse Basée sur l'IA exploite l'apprentissage automatique avancé et la modélisation prédictive pour transformer vos données brutes en informations exploitables. Obtenez un avantage concurrentiel avec des analyses en temps réel, des tableaux de bord personnalisables et des algorithmes d'apprentissage profond adaptés à vos besoins commerciaux.",
    "services.cloud.title": "Infrastructure Cloud",
    "services.cloud.description": "Bénéficiez d'une scalabilité et d'une fiabilité inégalées avec nos solutions d'infrastructure cloud.",
    "services.cloud.detailedDescription": "Bénéficiez d'une scalabilité et d'une fiabilité inégalées avec nos solutions d'infrastructure cloud. Nous offrons des environnements cloud sécurisés et performants avec un temps de disponibilité de 99,9 %, une intégration transparente et une mise à l'échelle automatisée pour soutenir la croissance de votre entreprise.",
    "services.cybersecurity.title": "Suite de Cybersécurité",
    "services.cybersecurity.description": "Protégez vos actifs numériques avec notre suite de cybersécurité complète.",
    "services.cybersecurity.detailedDescription": "Protégez vos actifs numériques avec notre suite de cybersécurité complète. Dotée d'une détection avancée des menaces, d'une surveillance en temps réel et de mécanismes de défense proactifs, nos solutions garantissent que vos données restent sécurisées face aux menaces évolutives.",
    "services.custom.title": "Développement Personnalisé",
    "services.custom.description": "Nos services de développement personnalisé offrent des solutions logicielles sur mesure adaptées à vos besoins uniques.",
    "services.custom.detailedDescription": "Nos services de développement personnalisé offrent des solutions logicielles sur mesure adaptées à vos besoins uniques. En utilisant les derniers frameworks et technologies, nous construisons des applications évolutives, sécurisées et conviviales qui favorisent le succès de votre entreprise.",
    "services.bi.title": "Intelligence d'Affaires",
    "services.bi.description": "Libérez la puissance de vos données avec nos outils d'intelligence d'affaires.",
    "services.bi.detailedDescription": "Libérez la puissance de vos données avec nos outils d'intelligence d'affaires. Nos tableaux de bord en temps réel, rapports avancés et solutions de visualisation de données offrent des informations détaillées sur les métriques de performance, vous aidant à prendre des décisions stratégiques éclairées.",
    "services.digital.title": "Transformation Numérique",
    "services.digital.description": "Accélérez votre entreprise avec nos services de transformation numérique.",
    "services.digital.detailedDescription": "Accélérez votre entreprise avec nos services de transformation numérique. Nous modernisons vos opérations, intégrons des technologies de pointe et optimisons les processus pour améliorer l'efficacité et maintenir un avantage concurrentiel dans l'ère numérique.",
    "testimonials.title": "Ce que disent les leaders de l'industrie",
    "testimonials.t1.text": "Mr Solution a transformé toute notre infrastructure technologique. Leurs solutions d'IA ont augmenté notre efficacité de 40 % et ont révolutionné notre approche des données.",
    "testimonials.t1.author": "Sarah Johnson",
    "testimonials.t1.role": "PDG, TechNova Inc.",
    "testimonials.t2.text": "Le support premium et les services de développement personnalisé ont dépassé toutes les attentes. Leur équipe a livré des solutions parfaitement alignées sur notre vision.",
    "testimonials.t2.author": "Michael Chen",
    "testimonials.t2.role": "Directeur de la Technologie, Innovatech",
    "testimonials.t3.text": "Mise en œuvre exceptionnelle de la cybersécurité. Nous n'avons eu aucun incident de sécurité depuis notre partenariat avec Mr Solution. Leur approche proactive est inégalée.",
    "testimonials.t3.author": "Emily Rodriguez",
    "testimonials.t3.role": "Directrice de la Sécurité de l'Information, SecureCore",
    "faq.title": "Questions Fréquemment Posées",
    "faq.q1": "Quels services propose Mr Solution ?",
    "faq.a1": "Mr Solution propose des analyses basées sur l'IA, une infrastructure cloud, de la cybersécurité, du développement personnalisé, de l'intelligence d'affaires et des services de transformation numérique adaptés à vos besoins.",
    "faq.q2": "Comment puis-je commencer avec un essai gratuit ?",
    "faq.a2": "Contactez-nous via le formulaire en bas de page ou cliquez sur 'Démarrer l'Essai Gratuit' dans la section CTA, et notre équipe vous guidera tout au long du processus.",
    "faq.q3": "Mes données sont-elles sécurisées avec vos solutions ?",
    "faq.a3": "Absolument. Notre suite de cybersécurité utilise une détection avancée des menaces et un chiffrement pour garantir que vos données soient protégées à tout moment.",
    "faq.q4": "Proposez-vous un support pour des projets personnalisés ?",
    "faq.a4": "Oui, notre équipe de développement personnalisé est spécialisée dans la création de solutions sur mesure adaptées à vos besoins uniques.",
    "cta.title": "Prêt à Transformer Votre Entreprise ?",
    "cta.description": "Rejoignez des milliers d'entreprises qui exploitent déjà nos solutions premium pour rester en tête dans la révolution numérique. Commencez avec notre plan premium exclusif dès aujourd'hui.",
    "cta.button": "Démarrer l'Essai Gratuit",
    "cta.view": "Voir les Tarifs",
    "footer.content.title": "Mr Solution",
    "footer.content.description": "Pionnier de l'avenir de la technologie avec des solutions innovantes qui permettent aux entreprises d'atteindre une croissance et une efficacité sans précédent.",
    "footer.services.title": "Services",
    "footer.links.title": "Liens Rapides",
    "footer.contact.title": "Contact",
    "footer.newsletter.title": "Newsletter",
    "footer.newsletter.description": "Restez informé des dernières actualités et offres technologiques !",
    "footer.copyright": "© 2025 Mr Solution. Tous droits réservés."
  }
}
